---
kind: method
id: M:Autodesk.Revit.DB.GroupSet.Erase(Autodesk.Revit.DB.Group)
source: html/f592e34f-3c7f-3d4f-406e-f9e27a72dfc9.htm
---
# Autodesk.Revit.DB.GroupSet.Erase Method

Removes a specified group from the set.

## Syntax (C#)
```csharp
public virtual int Erase(
	Group item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Group`) - The group to be erased.

## Returns
The number of groups that were erased from the set.